blubirdsong/app/controllers/api/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT "replies".* FROM "replies" WHERE "replies"."post_id" IN ($1, $2)  [["post_id", 3], ["post_id", 2]]
---
        def index
            @posts = Post.includes(:replies).order(created_at: :desc)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "replies".* FROM "replies" WHERE "replies"."post_id" = $1  [["post_id", 1]]
---
        def show
            render json: {message: "Post fetched successfully", data: Post.includes(:replies).find(params[:id]) }, status: :ok

INSERT INTO "posts" ("subject", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["subject", "Final Post"], ["body", "It can't be blank"], ["created_at", "2023-08-03 16:30:51.154383"], ["updated_at", "2023-08-03 16:30:51.154383"]]
---
        def create
            post = Post.create!(post_params)

UPDATE "posts" SET "subject" = $1, "body" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["subject", "Last is better than Final Post"], ["body", "Of course, another plot twist"], ["updated_at", "2023-08-03 18:17:57.222360"], ["id", 3]]
---
        def update
            # post = Post.find(params[:id]) - not needed because of before_action
            @post.update!(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        def set_post
            @post = Post.find_by(id: params[:id])
            return if @post.present?