blubirdsong/app/controllers/api/replies_controller.rb

        def create
            @post = Post.find(params[:post_id])
            @reply = @post.replies.build(reply_params)

            if params[:parent_reply_id].present?
                parent_reply = @post.replies.find_by(id: params[:parent_reply_id])
                @reply.parent_reply = parent_reply if parent_reply
            end

            if @reply.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "replies".* FROM "replies" WHERE "replies"."post_id" = $1 AND "replies"."id" = $2 LIMIT $3  [["post_id", 2], ["id", 2], ["LIMIT", 1]]
INSERT INTO "replies" ("content", "post_id", "parent_reply_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

        def index
            @post = Post.find(params[:post_id])
            all_replies = []
            @post.replies.where(parent_reply_id: nil).each do |reply|
                all_replies.push(reply.attributes.merge(nested_replies: reply.nested_replies))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "replies".* FROM "replies" WHERE "replies"."post_id" = $1 AND "replies"."parent_reply_id" IS NULL  [["post_id", 2]]
UPDATE "replies" SET "content" = $1, "updated_at" = $2 WHERE "replies"."id" = $3  [["content", "edited reply"], ["updated_at", "2023-08-03 01:58:19.423981"], ["id", 3]]

        def update
            if @reply.update(reply_params)
---
UPDATE "replies" SET "content" = $1, "updated_at" = $2 WHERE "replies"."id" = $3  [["content", "This is the fourth reply for BluBird! I am alive!"], ["updated_at", "2023-08-03 16:59:26.237809"], ["id", 1]]

        def destroy
            @reply.destroy
---
DELETE FROM "replies" WHERE "replies"."id" = $1  [["id", 9]]

        def set_reply
            @reply = Reply.find(params[:id])
---
SELECT "replies".* FROM "replies" WHERE "replies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]